app/Controllers/Home.php

SELECT *
FROM `tb_peserta`
---
    public function index()
    {
        //   $data_judul ['judul'] = 'Data Peserta';
        $judul = 'Dashboard';
        //   $judul_semua = $data_judul->findAll();
          $peserta_model = new Model_peserta();
          $all_data_peserta = $peserta_model->findAll();