app/Controllers/Import.php

SELECT *
FROM `tb_peserta`
WHERE `no_hp` = 123
---
                                $db = \Config\Database::connect();

                                //cek isi table
                                $cek = $db->table('tb_peserta')->where('no_hp', $no_hp)->get()->getRowArray();