app/Controllers/Peserta.php

    public function index()
    {
        $judul = 'Data Peserta';
        $peserta_model = new Model_peserta();
        $all_data_peserta = $peserta_model->findAll();
---
SELECT *
FROM `tb_peserta`